# Описание/Пошаговая инструкция выполнения домашнего задания:
> - Придумать 2-3 варианта, когда применима графовая база данных. Можно даже абзац на контекст каждого примера.
> - Воспользоваться моделью, данными и командами из лекции или одним из своих примеров из пункта 1 и реализовать аналог в любой выбранной БД (реляционной или нет - на выбор). Сравнить команды.
> - Записать, что удобнее было сделать в выбранной БД, а что в Neo4j и привести примеры.


## Варианты применения графовых баз данных
### Применение графовых баз данных в химии
> - #### Графы в химических соединениях: 
>  Химические соединения могут быть представлены в виде графов, где атомы представляют вершины, а химические связи – ребра. Анализ графа соединения позволяет определить его структуру, связи между атомами и другие химические свойства.

> - #### Анализ химических реакций с помощью графов
>  Графы также используются для анализа химических реакций. В этом случае, каждая молекула представляется в виде графа, а реакция – в виде графа, объединяющего все молекулы, участвующие в реакции. Анализ графа реакции может позволить определить изменения в структуре молекул и выявить основные химические превращения.

> - #### Применение графов в изучении молекулярной структуры
>  Графы также находят применение в изучении молекулярной структуры. Молекулы могут быть представлены в виде графов, где атомы представляют вершины, а химические связи – ребра. Анализ графа молекулы может позволить определить ее форму, размеры, связи между атомами и другие химические свойства.

### Применение графовых баз данных в биологии, медицине, биоинформатике
> - #### Применение графов для исследования бактериальных популяций
>  Здесь важны такие возможностиб как возможность поиска ``цепочек'' объектов с известным начальными и конечными узлами, но неизвестным числом промежуточных шагов, совместное хранение противоречивых данных.
 
> - #### Исследование генома 
>  Графовые алгоритмы основаны на представлении генома в виде графа, где вершины представляют фрагменты ДНК или РНК, а ребра – связи между ними. Алгоритмы строят граф, объединяя схожие фрагменты, и затем находят путь в графе, который представляет исходный геном.

## Сравнение моделей данных и запросов графовой и реляционной баз данных
В качестве примера использовалась тестовая графовая база Movie Graph 
В тестовой графовой базе используются ноды Person и Movie и связи (ребра) типа DIRECTED, ACTED_IN, ...
```sh
-- запрос - какие актеры играли в тех же фильмах, в которых играл Том Хенкс
MATCH (tom:Person {name:"Tom Hanks"})-[:ACTED_IN]->(m)<-[:ACTED_IN]-(coActors) RETURN DISTINCT coActors.name

╒════════════════════════╕
│coActors.name           │
╞════════════════════════╡
│"Meg Ryan"              │
├────────────────────────┤
│"Greg Kinnear"          │
├────────────────────────┤
│"Parker Posey"          │
├────────────────────────┤
│"Dave Chappelle"        │
├────────────────────────┤
│"Steve Zahn"            │
├────────────────────────┤
│"Rita Wilson"           │
├────────────────────────┤
│"Bill Pullman"          │
├────────────────────────┤
│"Victor Garber"         │
├────────────────────────┤
│"Rosie O'Donnell"       │
├────────────────────────┤
│"Nathan Lane"           │
├────────────────────────┤
│"Charlize Theron"       │
├────────────────────────┤
│"Liv Tyler"             │
├────────────────────────┤
│"Hugo Weaving"          │
├────────────────────────┤
│"Halle Berry"           │
├────────────────────────┤
│"Jim Broadbent"         │
├────────────────────────┤
│"Ian McKellen"          │
├────────────────────────┤
│"Audrey Tautou"         │
├────────────────────────┤
│"Paul Bettany"          │
├────────────────────────┤
│"Bonnie Hunt"           │
├────────────────────────┤
│"James Cromwell"        │
├────────────────────────┤
│"Michael Clarke Duncan" │
├────────────────────────┤
│"David Morse"           │
├────────────────────────┤
│"Sam Rockwell"          │
├────────────────────────┤
│"Gary Sinise"           │
├────────────────────────┤
│"Patricia Clarkson"     │
├────────────────────────┤
│"Kevin Bacon"           │
├────────────────────────┤
│"Ed Harris"             │
├────────────────────────┤
│"Bill Paxton"           │
├────────────────────────┤
│"Helen Hunt"            │
├────────────────────────┤
│"Philip Seymour Hoffman"│
├────────────────────────┤
│"Julia Roberts"         │
├────────────────────────┤
│"Madonna"               │
├────────────────────────┤
│"Geena Davis"           │
├────────────────────────┤
│"Lori Petty"            │
└────────────────────────┘
```

Для реализации аналогии в реляционной базе данных Postgres потребуется, как минимум, три таблицы
```sh
create table person
(
    person_id         bigint generated always as identity
        primary key,
    person_name       text,
    person_birth_date date
);

create table movie
(
    movie_id         bigint generated always as identity
        primary key,
    movie_title      text,
    pmovie_date      date
);

-- таблица связей
create table person_movie_link
(
    link_id         bigint generated always as identity
        primary key,
    person_id       bigint,
    movie_id        bigint,
    link_role       varchar(64)  -- DIRECTED, ACTED_IN, ...
);

-- запрос - какие актеры играли в тех же фильмах, в которых играл Том Хенкс
select d.person_name
from person a 
inner join person_movie_link b on b.person_id = a.person_id 
inner join person_movie_link c on c.movie = b.movie
inner join person d.person_id = c.person_id
where a.person_name = 'Tom Hanks'
  and b.link_role = 'ACTED_IN'
  and d.link_role = 'ACTED_IN'
  and d.person_name <> 'Tom Hanks'
           
```

Запрос в графовой базе данных выглядит явно короче и выразительней.
Графовую базу данных удобнее использовать в случаях, когда предполагается много сущностей, между 
которыми предполагаются связи многие-ко-многим.
Также, графовые базы удобнее использовать в случае свойства сущностей строго не определены и могут меняться
для разных сущностей одного типа. Такой вариант в реляционной базе приведет к частому изменению структуры
таблиц и появлению разряженных данных

Но отсутствие схемы и отсутствие контроля типов на стороне графовой БД может негативно сказаться, например
на использовании таких баз из внешних сервисов. Может приводить к ошибкам при преобразовании данных

